{
  "common": {
    "name": "meross",
    "version": "1.10.2",
    "news": {
      "1.10.2": {
        "en": "Correctly set the garageDoorWorking flag after starting a control action",
        "de": "Das GarageDoorWorking-Flag nach dem Start einer Steueraktion korrekt setzen",
        "ru": "Корректная установка флага GarageDoorWorking после запуска управляющего действия",
        "pt": "Defina corretamente o sinalizador garageDoorWorking após iniciar uma ação de controle",
        "nl": "Stel de garageDoorWorking-vlag correct in na het starten van een besturingsactie",
        "fr": "Définissez correctement l'indicateur garageDoorWorking après le démarrage d'une action de contrôle",
        "it": "Impostare correttamente il flag garageDoorWorking dopo aver avviato un'azione di controllo",
        "es": "Configure correctamente el indicador garageDoorWorking después de iniciar una acción de control",
        "pl": "Poprawnie ustawić flagę GarażDoorPraca po uruchomieniu akcji kontrolnej",
        "zh-cn": "开始控制动作后正确设置garageDoorWorking标志"
      },
      "1.10.1": {
        "en": "Fix pot. crash case",
        "de": "Topf fixieren. Crash-Fall",
        "ru": "Починить горшок. аварийный случай",
        "pt": "Conserte o pote. caso de acidente",
        "nl": "Pot repareren. crashgeval",
        "fr": "Casserole fixe. cas d'accident",
        "it": "Riparare la pentola. caso di incidente",
        "es": "Arreglar olla. caso de accidente",
        "pl": "Napraw garnek. wypadek wypadku",
        "zh-cn": "修锅。车祸案例"
      },
      "1.10.0": {
        "en": "Optimize Meross Communication to first try to communicate with the device locally before sending data to MQTT - enabled by default, you can disable it in settings!\nOptimize Meross Communication by using only one MQTT connection instead of one per device when cloud is used\nAdd new state \"disabled\" to ignore connection error of a device; reconnections are still tried, but no error are logged if not successful\nAdd support for Online status reports from MTS100 hub devices\nAutomatically logout from meross cloud on adapter end; next start will do a new Login\nAutomatically delete old devices if no longer existing (when js-controller >=2.2)\nOptimize MTS200 handling",
        "de": "Optimieren Sie die Meross-Kommunikation, um zuerst zu versuchen, lokal mit dem Gerät zu kommunizieren, bevor Sie Daten an MQTT senden - standardmäßig aktiviert, Sie können es in den Einstellungen deaktivieren!\nOptimieren Sie die Meross-Kommunikation, indem Sie nur eine MQTT-Verbindung statt einer pro Gerät verwenden, wenn die Cloud verwendet wird\nNeuen Zustand „deaktiviert“ hinzufügen, um Verbindungsfehler eines Geräts zu ignorieren; Wiederverbindungen werden immer noch versucht, aber es werden keine Fehler protokolliert, wenn sie nicht erfolgreich sind\nUnterstützung für Online-Statusberichte von MTS100-Hub-Geräten hinzugefügt\nAutomatisches Abmelden von der Meross-Cloud am Adapterende; Beim nächsten Start wird ein neuer Login durchgeführt\nAlte Geräte automatisch löschen, wenn nicht mehr vorhanden (wenn js-controller >=2.2)\nOptimieren Sie die Handhabung des MTS200",
        "ru": "Оптимизируйте связь Meross, чтобы сначала попытаться связаться с устройством локально перед отправкой данных в MQTT — включено по умолчанию, вы можете отключить его в настройках!\nОптимизируйте связь Meross, используя только одно соединение MQTT вместо одного на устройство при использовании облака.\nДобавлено новое состояние «отключено», чтобы игнорировать ошибку подключения устройства; повторные подключения все еще предпринимаются, но в случае неудачи не регистрируется никаких ошибок\nДобавлена поддержка онлайн-отчетов о состоянии с узловых устройств MTS100.\nАвтоматический выход из облака meross на стороне адаптера; при следующем запуске будет выполнен новый вход в систему\nАвтоматически удалять старые устройства, если они больше не существуют (когда js-controller>=2.2)\nОптимизация работы с MTS200",
        "pt": "Otimize a comunicação Meross para primeiro tentar se comunicar com o dispositivo localmente antes de enviar dados para o MQTT - ativado por padrão, você pode desativá-lo nas configurações!\nOtimize a comunicação Meross usando apenas uma conexão MQTT em vez de uma por dispositivo quando a nuvem é usada\nAdicionar novo estado \"desabilitado\" para ignorar erro de conexão de um dispositivo; as reconexões ainda são tentadas, mas nenhum erro é registrado se não for bem-sucedida\nAdicione suporte para relatórios de status online de dispositivos de hub MTS100\nLogout automaticamente da nuvem meross na extremidade do adaptador; próxima partida fará um novo Login\nExclua automaticamente dispositivos antigos se não existirem mais (quando js-controller >=2.2)\nOtimize o manuseio do MTS200",
        "nl": "Optimaliseer Meross-communicatie om eerst lokaal met het apparaat te communiceren voordat u gegevens naar MQTT verzendt - standaard ingeschakeld, u kunt dit uitschakelen in de instellingen!\nOptimaliseer Meross-communicatie door slechts één MQTT-verbinding te gebruiken in plaats van één per apparaat wanneer de cloud wordt gebruikt\nVoeg een nieuwe status \"uitgeschakeld\" toe om de verbindingsfout van een apparaat te negeren; er wordt nog steeds geprobeerd om opnieuw verbinding te maken, maar er wordt geen fout geregistreerd als dit niet lukt\nOndersteuning toevoegen voor online statusrapporten van MTS100-hubapparaten\nAutomatisch uitloggen van meross cloud aan het uiteinde van de adapter; volgende start zal een nieuwe login doen\nVerwijder automatisch oude apparaten als ze niet meer bestaan (wanneer js-controller >=2.2)\nOptimaliseer de afhandeling van de MTS200",
        "fr": "Optimisez la communication Meross pour essayer d'abord de communiquer avec l'appareil localement avant d'envoyer des données à MQTT - activé par défaut, vous pouvez le désactiver dans les paramètres !\nOptimisez la communication Meross en utilisant une seule connexion MQTT au lieu d'une par appareil lorsque le cloud est utilisé\nAjouter un nouvel état \"désactivé\" pour ignorer l'erreur de connexion d'un appareil ; les reconnexions sont toujours tentées, mais aucune erreur n'est consignée en cas d'échec\nAjout de la prise en charge des rapports d'état en ligne des périphériques concentrateurs MTS100\nSe déconnecte automatiquement du cloud meross à l'extrémité de l'adaptateur ; le prochain démarrage fera une nouvelle connexion\nSupprimer automatiquement les anciens appareils s'ils n'existent plus (lorsque js-controller >=2.2)\nOptimiser la manipulation du MTS200",
        "it": "Ottimizza la comunicazione Meross per provare a comunicare con il dispositivo localmente prima di inviare i dati a MQTT - abilitato per impostazione predefinita, puoi disabilitarlo nelle impostazioni!\nOttimizza la comunicazione Meross utilizzando una sola connessione MQTT anziché una per dispositivo quando viene utilizzato il cloud\nAggiungi il nuovo stato \"disabilitato\" per ignorare l'errore di connessione di un dispositivo; le riconnessioni vengono ancora tentate, ma non vengono registrati errori se non hanno esito positivo\nAggiungi il supporto per i rapporti di stato online dai dispositivi hub MTS100\nDisconnettersi automaticamente dal cloud meross all'estremità dell'adattatore; il prossimo inizio eseguirà un nuovo accesso\nElimina automaticamente i vecchi dispositivi se non esistono più (quando js-controller >=2.2)\nOttimizza la gestione dell'MTS200",
        "es": "Optimice Meross Communication para intentar primero comunicarse con el dispositivo localmente antes de enviar datos a MQTT; habilitado de manera predeterminada, ¡puede deshabilitarlo en la configuración!\nOptimice Meross Communication usando solo una conexión MQTT en lugar de una por dispositivo cuando se usa la nube\nAgregar nuevo estado \"deshabilitado\" para ignorar el error de conexión de un dispositivo; las reconexiones aún se intentan, pero no se registra ningún error si no se realiza correctamente\nAgregue soporte para informes de estado en línea desde dispositivos concentradores MTS100\nCerrar sesión automáticamente desde la nube de meross en el extremo del adaptador; el próximo inicio hará un nuevo inicio de sesión\nEliminar automáticamente los dispositivos antiguos si ya no existen (cuando js-controller >=2.2)\nOptimizar el manejo de MTS200",
        "pl": "Zoptymalizuj komunikację Meross, aby najpierw spróbować komunikować się z urządzeniem lokalnie przed wysłaniem danych do MQTT - domyślnie włączone, można je wyłączyć w ustawieniach!\nZoptymalizuj komunikację Meross, używając tylko jednego połączenia MQTT zamiast jednego na urządzenie, gdy używana jest chmura\nDodaj nowy stan „wyłączony”, aby zignorować błąd połączenia urządzenia; próby ponownego połączenia są nadal próbowane, ale w przypadku niepowodzenia żaden błąd nie jest rejestrowany\nDodaj obsługę raportów o stanie online z urządzeń koncentratora MTS100\nAutomatycznie wyloguj się z chmury meross na końcu adaptera; następny start wykona nowe logowanie\nAutomatycznie usuwaj stare urządzenia, jeśli już nie istnieją (gdy js-controller >=2.2)\nZoptymalizuj obsługę MTS200",
        "zh-cn": "优化 Meross 通信，在向 MQTT 发送数据之前先尝试与设备本地通信 - 默认启用，您可以在设置中禁用它！\n使用云时，仅使用一个 MQTT 连接而不是每个设备一个，优化 Meross 通信\n添加新状态“禁用”以忽略设备的连接错误；仍然尝试重新连接，但如果不成功则不会记录错误\n添加对来自 MTS100 集线器设备的在线状态报告的支持\n适配器端自动退出meross云；下一次开始将做一个新的登录\n如果不再存在，则自动删除旧设备（当 js-controller >=2.2 时）\n优化 MTS200 处理"
      },
      "1.8.0": {
        "en": "Add support for MTS200 Wifi Thermostat",
        "de": "Unterstützung für MTS200 Wifi Thermostat hinzufügen",
        "ru": "Добавить поддержку термостата MTS200 Wifi",
        "pt": "Adicionar suporte para termostato Wifi MTS200",
        "nl": "Ondersteuning toevoegen voor MTS200 Wifi-thermostaat",
        "fr": "Ajout de la prise en charge du thermostat Wifi MTS200",
        "it": "Aggiungi il supporto per il termostato Wi-Fi MTS200",
        "es": "Agregue soporte para el termostato Wifi MTS200",
        "pl": "Dodaj obsługę termostatu Wifi MTS200",
        "zh-cn": "添加对 MTS200 Wifi 恒温器的支持"
      },
      "1.7.1": {
        "en": "Allow to enter passwords with more than 15 characters",
        "de": "Erlaube die Eingabe von Passwörtern mit mehr als 15 Zeichen",
        "ru": "Разрешить вводить пароли длиной более 15 символов",
        "pt": "Permite inserir senhas com mais de 15 caracteres",
        "nl": "Sta toe om wachtwoorden in te voeren met meer dan 15 tekens",
        "fr": "Autoriser la saisie de mots de passe de plus de 15 caractères",
        "it": "Consenti l'inserimento di password con più di 15 caratteri",
        "es": "Permitir ingresar contraseñas con más de 15 caracteres",
        "pl": "Zezwalaj na wprowadzanie haseł zawierających więcej niż 15 znaków",
        "zh-cn": "允许输入超过 15 个字符的密码"
      },
      "1.7.0": {
        "en": "Add support for MTS150 Thermostats\nAdd support for MRS100 RollerShutter devices",
        "de": "Unterstützung für MTS150-Thermostate hinzufügen\nUnterstützung für MRS100 RollerShutter-Geräte hinzufügen",
        "ru": "Добавить поддержку термостатов MTS150\nДобавить поддержку устройств MRS100 RollerShutter",
        "pt": "Adicionar suporte para termostatos MTS150\nAdicionar suporte para dispositivos MRS100 RollerShutter",
        "nl": "Ondersteuning toevoegen voor MTS150-thermostaten\nOndersteuning toevoegen voor MRS100 RollerShutter-apparaten",
        "fr": "Ajout de la prise en charge des thermostats MTS150\nAjout de la prise en charge des dispositifs MRS100 RollerShutter",
        "it": "Aggiungi il supporto per i termostati MTS150\nAggiungi il supporto per i dispositivi RollerShutter MRS100",
        "es": "Agregar soporte para termostatos MTS150\nAgregue soporte para dispositivos RollerShutter MRS100",
        "pl": "Dodaj obsługę termostatów MTS150\nDodaj obsługę urządzeń MRS100 RollerShutter",
        "zh-cn": "添加对 MTS150 恒温器的支持\n添加对 MRS100 RollerShutter 设备的支持"
      },
      "1.6.3": {
        "en": "Update translations",
        "de": "Übersetzungen aktualisieren",
        "ru": "Обновить переводы",
        "pt": "Atualizar traduções",
        "nl": "Vertalingen bijwerken",
        "fr": "Mettre à jour les traductions",
        "it": "Aggiorna traduzioni",
        "es": "Actualizar traducciones",
        "pl": "Zaktualizuj tłumaczenia",
        "zh-cn": "更新翻译"
      }
    },
    "title": "Meross Cloud",
    "titleLang": {
      "en": "Meross Cloud",
      "de": "Meross Cloud",
      "ru": "Meross Cloud",
      "pt": "Meross Cloud",
      "nl": "Meross Cloud",
      "fr": "Meross Cloud",
      "it": "Meross Cloud",
      "es": "Meross Cloud",
      "pl": "Meross Cloud",
      "zh-cn": "美洛斯云"
    },
    "desc": {
      "en": "support for Meross Wifi devices",
      "de": "Unterstützung für Meross Wifi-Geräte",
      "ru": "поддержка устройств Meross Wifi",
      "pt": "suporte para dispositivos Wifi Meross",
      "nl": "ondersteuning voor Meross Wifi-apparaten",
      "fr": "support pour les appareils Meross Wifi",
      "it": "supporto per i dispositivi Meross Wifi",
      "es": "soporte para dispositivos wifi Meross",
      "pl": "obsługa urządzeń Wi-Fi firmy Meross",
      "zh-cn": "支持Meross Wifi设备"
    },
    "authors": [
      "Apollon77 <ingo@fischer-ka.de>"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "icon": "meross.png",
    "materialize": true,
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.meross/master/admin/meross.png",
    "keywords": [
      "Meross"
    ],
    "readme": "https://github.com/Apollon77/ioBroker.meross/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "stopTimeout": 5000,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "push",
    "tier": 2,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://4e753a8ae86d4ff89cb9ceda7c62855e@sentry.iobroker.net/4",
        "pathWhitelist": [
          "@apollon",
          "meross-cloud"
        ]
      }
    }
  },
  "encryptedNative": [
    "password"
  ],
  "protectedNative": [
    "password"
  ],
  "native": {
    "user": "",
    "password": "",
    "electricityPollingInterval": 30,
    "electricityPollingIntervalReChecked": false,
    "noDirectLocalCommunication": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If connected to Meross Cloud",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
